docs/quota/STATUS.org
## -*- mode: org -*-
#+TITLE: Quota SMP project status
#+OPTIONS: ^:{}
* patches:
1) quota initialization improvements
   - optimize case where quota already initialized
   - redesign dqptr_sem management for vfs_dq_init()
  
2) ext4 journalled quota make_dirty seed-up
   - optimize ->make_dirty() callback for journalled quota.

3) ext3 journalled quota make_dirty seed-up
   - optimize ->make_dirty() callback for journalled quota.


* PERFORMANCE CHART
- System :: Laptop thinkpad t60 Core Duo T2500 (2 cores) 
- open-close     :: close(open())
- open-unlink    :: unlink(open())
- write-truncate ::  pwrite(,,40960,0); truncate(0)
- measured value :: ops/ms == loops per millisecond 
- w/o quot :: without quota 
- w quot :: with journalled quota on
- w sem :: with dqptr_sem improvement patch
- w mk_drt :: with journalled make_dirty patch
** EXT4 journaled quota + delalloc
#+PLOT: tasks:"open-close" ind:1 deps:(2 3 4) type:2d with:histograms set:"yrange [0:]"
|---------------+----------+--------+----------+-------------|
|    open-close | w/o quot | w quot | w sem(1) | w mk_drt(2) |
| NR tasks    1 |      170 |    104 |      161 |         173 |
|               |      176 |    104 |      166 |         172 |
|               |      176 |    104 |      161 |         172 |
|               |          |        |          |             |
|             4 |       80 |     42 |       81 |          79 |
|               |       80 |     42 |       78 |          78 |
|               |       80 |     41 |       80 |          79 |
|               |          |        |          |             |
|             8 |       34 |      4 |       28 |          32 |
|               |       27 |      5 |       23 |          38 |
|               |       33 |      5 |       25 |          35 |
|               |          |        |          |             |

#+PLOT: tasks:"open-unlink" ind:1 deps:(2 3 4) type:2d with:histograms set:"yrange [0:]"
| open-unlink | w/o quot | w quot | w sem(1) | w mk_drt(2) |
|  NR tasks 1 |       25 |   12.7 |       16 |        15.3 |
|             |       25 |   12.8 |       16 |        15.3 |
|             |       24 |   12.7 |       16 |        15.2 |
|             |          |        |          |             |
|           4 |      8.9 |    1.1 |      3.8 |         3.8 |
|             |      8.9 |    1.1 |      3.3 |         3.9 |
|             |      8.1 |    1.1 |      3.8 |         4.0 |
|             |          |        |          |             |
|           8 |      4.3 |   0.54 |     1.12 |        1.37 |
|             |      4.3 |   0.53 |     1.41 |         1.5 |
|             |      3.9 |   0.53 |      1.5 |        1.52 |
|             |          |        |          |             |
|-------------+----------+--------+----------+-------------|

#+PLOT: tasks:"write-truncate" ind:1 deps:(2 3 4) type:2d with:histograms set:"yrange [0:]"
| write-truncate | w/o quot | w quot | w sem(1) | w mk_drt(2) |
|     NR tasks 1 |     32.1 |   30.1 |     30.7 |        30.1 |
|                |     31.8 |   30.7 |     30.6 |        30.2 |
|                |     32.0 |   30.6 |     30.6 |        30.0 |
|                |          |        |          |             |
|              4 |      8.8 |   8.45 |      8.1 |         8.3 |
|                |      9.0 |    9.1 |      8.2 |         9.4 |
|                |      9.1 |    8.9 |      9.5 |         8.4 |
|                |          |        |          |             |
|              8 |      4.9 |    4.6 |      4.8 |        4.75 |
|                |      4.9 |    4.5 |      4.7 |         5.1 |
|                |      4.7 |    4.9 |      4.5 |         5.8 |
|----------------+----------+--------+----------+-------------|
  
** EXT4: journaled quota + nodelalloc
#+PLOT: tasks:"tasks" ind:1 deps:(2 3 4) type:2d with:histograms set:"yrange [0:]"
| write-truncate | w/o quot | w jquot | w jquot mk_drt patch(2) |
|     NR tasks 1 |     20.4 |    14.5 |                   14.83 |
|                |     20.3 |    14.7 |                    14.7 |
|                |     20.4 |    14.8 |                    14.8 |
|                |          |         |                         |
|              4 |      6.1 |    4.76 |                     6.3 |
|                |      6.3 |     5.1 |                     6.1 |
|                |      6.5 |     4.8 |                     6.3 |
|                |          |         |                         |
|              8 |     3.75 |    2.59 |                    3.34 |
|                |      4.0 |     2.6 |                    3.44 |
|                |     3.76 |    2.63 |                    3.47 |

** EXT3: with journaled quota
#+PLOT: tasks:"tasks" ind:1 deps:(2 3 4) type:2d with:histograms set:"yrange [0:]"
| write-truncate | w/o quot | w jquot | w jquot mk_drt patch(3) |
|              1 |     27.5 |    15.7 |                    15.7 |
|                |     27.1 |    15.5 |                    16.1 |
|                |     26.7 |    16.0 |                    16.1 |
|                |          |         |                         |
|              4 |      7.8 |    3.37 |                    6.35 |
|                |     7.14 |    3.39 |                    6.16 |
|                |      8.2 |     3.1 |                    6.24 |
|                |          |         |                         |
|              8 |     3.94 |    1.71 |                    3.86 |
|                |     4.21 |    1.79 |                     4.3 |
|                |     4.41 |    1.68 |                     3.9 |
