docs/quota/STATUS.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>

<title>Quota SMP project status</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-03-29 08:23:53 MSD"/>
<meta name="author" content="Dmitry Monakhov"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">
<h1 class="title">Quota SMP project status</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 patches: </a></li>
<li><a href="#sec-2">2 PERFORMANCE CHART </a>
<ul>
<li><a href="#sec-2.1">2.1 EXT4 journaled quota + delalloc </a></li>
<li><a href="#sec-2.2">2.2 EXT4: journaled quota + nodelalloc </a></li>
<li><a href="#sec-2.3">2.3 EXT3: with journaled quota </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> patches: </h2>
<div class="outline-text-2" id="text-1">

<ol>
<li>
quota initialization improvements
<ul>
<li>
optimize case where quota already initialized
</li>
<li>
redesign dqptr_sem management for vfs_dq_init()

</li>
</ul>
</li>
<li>
ext4 journalled quota make_dirty seed-up
<ul>
<li>
optimize -&gt;make_dirty() callback for journalled quota.

</li>
</ul>
</li>
<li>
ext3 journalled quota make_dirty seed-up
<ul>
<li>
optimize -&gt;make_dirty() callback for journalled quota.


</li>
</ul>
</li>
</ol>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> PERFORMANCE CHART </h2>
<div class="outline-text-2" id="text-2">

<dl>
<dt>System</dt><dd>
Laptop thinkpad t60 Core Duo T2500 (2 cores) 
</dd>
<dt>open-close    </dt><dd>
close(open())
</dd>
<dt>open-unlink   </dt><dd>
unlink(open())
</dd>
<dt>write-truncate</dt><dd>
pwrite(,,40960,0); truncate(0)
</dd>
<dt>measured value</dt><dd>
ops/ms == loops per millisecond 
</dd>
<dt>w/o quot</dt><dd>
without quota 
</dd>
<dt>w quot</dt><dd>
with journalled quota on
</dd>
<dt>w sem</dt><dd>
with dqptr_sem improvement patch
</dd>
<dt>w mk_drt</dt><dd>
with journalled make_dirty patch
</dd>
</dl>

</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> EXT4 journaled quota + delalloc </h3>
<div class="outline-text-3" id="text-2.1">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="right" /><col align="right" /><col align="right" /><col align="right" />
</colgroup>
<tbody>
<tr><td>open-close</td><td>w/o quot</td><td>w quot</td><td>w sem(1)</td><td>w mk_drt(2)</td></tr>
<tr><td>NR tasks    1</td><td>170</td><td>104</td><td>161</td><td>173</td></tr>
<tr><td></td><td>176</td><td>104</td><td>166</td><td>172</td></tr>
<tr><td></td><td>176</td><td>104</td><td>161</td><td>172</td></tr>
<tr><td>4</td><td>80</td><td>42</td><td>81</td><td>79</td></tr>
<tr><td></td><td>80</td><td>42</td><td>78</td><td>78</td></tr>
<tr><td></td><td>80</td><td>41</td><td>80</td><td>79</td></tr>
<tr><td>8</td><td>34</td><td>4</td><td>28</td><td>32</td></tr>
<tr><td></td><td>27</td><td>5</td><td>23</td><td>38</td></tr>
<tr><td></td><td>33</td><td>5</td><td>25</td><td>35</td></tr>
</tbody>
</table>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="right" /><col align="right" /><col align="right" /><col align="right" />
</colgroup>
<tbody>
<tr><td>open-unlink</td><td>w/o quot</td><td>w quot</td><td>w sem(1)</td><td>w mk_drt(2)</td></tr>
<tr><td>NR tasks 1</td><td>25</td><td>12.7</td><td>16</td><td>15.3</td></tr>
<tr><td></td><td>25</td><td>12.8</td><td>16</td><td>15.3</td></tr>
<tr><td></td><td>24</td><td>12.7</td><td>16</td><td>15.2</td></tr>
<tr><td>4</td><td>8.9</td><td>1.1</td><td>3.8</td><td>3.8</td></tr>
<tr><td></td><td>8.9</td><td>1.1</td><td>3.3</td><td>3.9</td></tr>
<tr><td></td><td>8.1</td><td>1.1</td><td>3.8</td><td>4.0</td></tr>
<tr><td>8</td><td>4.3</td><td>0.54</td><td>1.12</td><td>1.37</td></tr>
<tr><td></td><td>4.3</td><td>0.53</td><td>1.41</td><td>1.5</td></tr>
<tr><td></td><td>3.9</td><td>0.53</td><td>1.5</td><td>1.52</td></tr>
</tbody>
</table>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="right" /><col align="right" /><col align="right" /><col align="right" />
</colgroup>
<tbody>
<tr><td>write-truncate</td><td>w/o quot</td><td>w quot</td><td>w sem(1)</td><td>w mk_drt(2)</td></tr>
<tr><td>NR tasks 1</td><td>32.1</td><td>30.1</td><td>30.7</td><td>30.1</td></tr>
<tr><td></td><td>31.8</td><td>30.7</td><td>30.6</td><td>30.2</td></tr>
<tr><td></td><td>32.0</td><td>30.6</td><td>30.6</td><td>30.0</td></tr>
<tr><td>4</td><td>8.8</td><td>8.45</td><td>8.1</td><td>8.3</td></tr>
<tr><td></td><td>9.0</td><td>9.1</td><td>8.2</td><td>9.4</td></tr>
<tr><td></td><td>9.1</td><td>8.9</td><td>9.5</td><td>8.4</td></tr>
<tr><td>8</td><td>4.9</td><td>4.6</td><td>4.8</td><td>4.75</td></tr>
<tr><td></td><td>4.9</td><td>4.5</td><td>4.7</td><td>5.1</td></tr>
<tr><td></td><td>4.7</td><td>4.9</td><td>4.5</td><td>5.8</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2"><span class="section-number-3">2.2</span> EXT4: journaled quota + nodelalloc </h3>
<div class="outline-text-3" id="text-2.2">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="right" /><col align="right" /><col align="right" />
</colgroup>
<tbody>
<tr><td>write-truncate</td><td>w/o quot</td><td>w jquot</td><td>w jquot mk_drt patch(2)</td></tr>
<tr><td>NR tasks 1</td><td>20.4</td><td>14.5</td><td>14.83</td></tr>
<tr><td></td><td>20.3</td><td>14.7</td><td>14.7</td></tr>
<tr><td></td><td>20.4</td><td>14.8</td><td>14.8</td></tr>
<tr><td>4</td><td>6.1</td><td>4.76</td><td>6.3</td></tr>
<tr><td></td><td>6.3</td><td>5.1</td><td>6.1</td></tr>
<tr><td></td><td>6.5</td><td>4.8</td><td>6.3</td></tr>
<tr><td>8</td><td>3.75</td><td>2.59</td><td>3.34</td></tr>
<tr><td></td><td>4.0</td><td>2.6</td><td>3.44</td></tr>
<tr><td></td><td>3.76</td><td>2.63</td><td>3.47</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-2.3" class="outline-3">
<h3 id="sec-2.3"><span class="section-number-3">2.3</span> EXT3: with journaled quota </h3>
<div class="outline-text-3" id="text-2.3">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="right" /><col align="right" /><col align="right" />
</colgroup>
<tbody>
<tr><td>write-truncate</td><td>w/o quot</td><td>w jquot</td><td>w jquot mk_drt patch(3)</td></tr>
<tr><td>1</td><td>27.5</td><td>15.7</td><td>15.7</td></tr>
<tr><td></td><td>27.1</td><td>15.5</td><td>16.1</td></tr>
<tr><td></td><td>26.7</td><td>16.0</td><td>16.1</td></tr>
<tr><td>4</td><td>7.8</td><td>3.37</td><td>6.35</td></tr>
<tr><td></td><td>7.14</td><td>3.39</td><td>6.16</td></tr>
<tr><td></td><td>8.2</td><td>3.1</td><td>6.24</td></tr>
<tr><td>8</td><td>3.94</td><td>1.71</td><td>3.86</td></tr>
<tr><td></td><td>4.21</td><td>1.79</td><td>4.3</td></tr>
<tr><td></td><td>4.41</td><td>1.68</td><td>3.9</td></tr>
</tbody>
</table>

</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Dmitry Monakhov
<a href="mailto:dmonakhov@openvz.org">&lt;dmonakhov@openvz.org&gt;</a>
</p>
<p class="date"> Date: 2010-03-29 08:23:53 MSD</p>
<p class="creator">HTML generated by org-mode 6.30c in emacs 23</p>
</div>
</div>
</body>
</html>
